#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	СформироватьДвиженияПродажи(Отказ);
	СформироватьДвиженияЗадолженностьАрендаторов(Отказ);

КонецПроцедуры



Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	 ПроверкиВДокументах.ПроверитьДоговор(Отказ, Договор, ДатаНачала, ДатаОкончания, ЭтотОбъект);
	 ПроверкиВДокументах.ПроверкаКвартиры(Отказ, Квартира, Договор.Квартира, ЭтотОбъект);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СформироватьДвиженияПродажи(Отказ)
	// регистр Продажи
	Движения.Продажи.Записывать = Истина;
	Движение = Движения.Продажи.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Квартира = Квартира;
	Движение.Договор = Договор;
	Движение.Сумма = Сумма;
КонецПроцедуры

Процедура СформироватьДвиженияЗадолженностьАрендаторов(Отказ)
	
	Движения.ЗадолженностьАрендаторов.Очистить();
	Движения.АвансыАрендаторов.Очистить();
	
	Движения.ЗадолженностьАрендаторов.Записывать = Истина;
	Движения.АвансыАрендаторов.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвансыАрендаторовОстатки.СуммаОстаток КАК Аванс
		|ИЗ
		|	РегистрНакопления.АвансыАрендаторов.Остатки(
		|			&Дата,
		|			Клиент = &Клиент
		|				И Договор = &Договор) КАК АвансыАрендаторовОстатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Аванс = 0;
	
	Если РезультатЗапроса.Следующий() Тогда
		Аванс = РезультатЗапроса.Аванс;
	КонецЕсли;
	
	Если Аванс > 0 Тогда
		
		СуммаАванса = Мин(Аванс, Сумма);
		
		ДвижениеАванс = Движения.АвансыАрендаторов.Добавить();
		ДвижениеАванс.Период = Дата;
		ДвижениеАванс.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижениеАванс.Клиент = Клиент;
		ДвижениеАванс.Договор = Договор;
		ДвижениеАванс.Сумма = СуммаАванса;
		
		Если Сумма > Аванс Тогда
			Движение = Движения.ЗадолженностьАрендаторов.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Клиент = Клиент;
			Движение.Договор = Договор;
			Движение.Сумма = Сумма - Аванс;
		КонецЕсли;
		
	Иначе
		Движение = Движения.ЗадолженностьАрендаторов.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.Сумма = Сумма;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
