
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Объект.ВремяНачалаУборки) И Не ЗначениеЗаполнено(Объект.ВремяОкончанияУборки) Тогда
		Объект.ВремяНачалаУборки = ТекущаяДата();
		Элементы.НачатьУборку.Заголовок = "Остановить уборку";
		Элементы.НачатьУборку.ЦветФона = Новый Цвет(233, 150, 122);
	ИначеЕсли ЗначениеЗаполнено(Объект.ВремяНачалаУборки) И Не ЗначениеЗаполнено(Объект.ВремяОкончанияУборки)  Тогда
		Объект.ВремяОкончанияУборки = ТекущаяДата();
		Элементы.НачатьУборку.Заголовок = "Уборка окончена";
		Элементы.НачатьУборку.ЦветФона = Новый Цвет(60, 179, 113);
		Элементы.НачатьУборку.Доступность = Ложь;
	КонецЕсли
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПолучитьГеопозицию(Команда)
	
	#Если МобильныйКлиент ИЛИ ВебКлиент Тогда
	
	Провайдер = СредстваГеопозиционирования.ПолучитьСамогоЭнергоЭкономичногоПровайдера();
	
	Если СредстваГеопозиционирования.ОбновитьМестоположение(Провайдер) Тогда
		ДанныеАдреса = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(Провайдер.Имя);
		Если ДанныеАдреса <> Неопределено Тогда
			Страна = ДанныеАдреса.Страна;
			Город = ДанныеАдреса.Город;
			Улица = ДанныеАдреса.Улица;
			Дом = ДанныеАдреса.Дом;
		Иначе
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не удалось установить адрес по местоположению!";
			Сообщение.Сообщить();
		КонецЕсли;
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось получить данные от провайдера геопозиционирования!";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Объект.Геопозиция = СтрШаблон("%1, %2, %3, %4", Страна, Город, Улица, Дом);
	#КонецЕсли
	
КонецПроцедуры


&НаКлиенте
Процедура НачатьУборку(Команда)
	Если Не ЗначениеЗаполнено(Объект.ВремяНачалаУборки) И Не ЗначениеЗаполнено(Объект.ВремяОкончанияУборки) Тогда
		Объект.ВремяНачалаУборки = ТекущаяДата();
		Элементы.НачатьУборку.Заголовок = "Остановить уборку";
		Элементы.НачатьУборку.ЦветФона = Новый Цвет(233, 150, 122);
	ИначеЕсли ЗначениеЗаполнено(Объект.ВремяНачалаУборки) И Не ЗначениеЗаполнено(Объект.ВремяОкончанияУборки)  Тогда
		Объект.ВремяОкончанияУборки = ТекущаяДата();
		Элементы.НачатьУборку.Заголовок = "Уборка окончена";
		Элементы.НачатьУборку.ЦветФона = Новый Цвет(60, 179, 113);
		Элементы.НачатьУборку.Доступность = Ложь;
	КонецЕсли
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
