
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОтправитьВМобильноеПриложение();

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьВМобильноеПриложение()
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЭтоАрендатор() Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбменСМобильнымПриложением.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.ОбменСМобильнымПриложением КАК ОбменСМобильнымПриложением
	|ГДЕ
	|	НЕ ОбменСМобильнымПриложением.ПометкаУдаления
	|	И НЕ ОбменСМобильнымПриложением.ЭтотУзел";

	Выборка = Запрос.Выполнить().Выбрать();

	УзлыДляРегистрации = Новый Массив;
	Пока Выборка.Следующий() Цикл

		ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
		УзлыДляРегистрации.Добавить(Выборка.Ссылка);

	КонецЦикла;

	Если ЗначениеЗаполнено(УзлыДляРегистрации) Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(УзлыДляРегистрации, Владелец);
	КонецЕсли;

КонецПроцедуры

Функция ЭтоАрендатор()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.Владелец = &Владелец
		|	И Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидДоговора.САрендатором)";
	
	Запрос.УстановитьПараметр("Владелец", Ссылка);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
