
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	СформироватьДвиженияВзаиморасчетыСАРендаторами();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СдачаВАренду") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Договор = ДанныеЗаполнения.Договор;
		Сумма = ДанныеЗаполнения.Сумма;
		Ответственный = ДанныеЗаполнения.Ответственный;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПродлениеАренды") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Договор = ДанныеЗаполнения.Договор;
		Сумма = ДанныеЗаполнения.Сумма;
		Ответственный = ДанныеЗаполнения.Ответственный;

	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияВзаиморасчетыСАРендаторами()

	Движения.ЗадолженностьАрендаторов.Очистить();
	Движения.АвансыАрендаторов.Очистить();
	
	Движения.ЗадолженностьАрендаторов.Записывать = Истина;
	Движения.АвансыАрендаторов.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадолженностьАрендаторовОстатки.СуммаОстаток КАК Долг
		|ИЗ
		|	РегистрНакопления.ЗадолженностьАрендаторов.Остатки(
		|			&Период,
		|			Клиент = &Клиент
		|				И Договор = &Договор) КАК ЗадолженностьАрендаторовОстатки";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Долг = 0;
	
	Если РезультатЗапроса.Следующий() Тогда
		Долг = РезультатЗапроса.Долг;
	КонецЕсли;
	
	Если Сумма <= Долг Тогда
		
		Движение = Движения.ЗадолженностьАрендаторов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Договор = Договор;
		Движение.Клиент = Клиент;
		Движение.Сумма = Сумма;
	Иначе
		
		Если Долг > 0 Тогда
			Движение = Движения.ЗадолженностьАрендаторов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Договор = Договор;
			Движение.Клиент = Клиент;
			Движение.Сумма = Сумма;
		КонецЕсли;
		
		ОстатокАванса = Сумма - Долг;
		
		Если ОстатокАванса > 0 Тогда
			Движение = Движения.АвансыАрендаторов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Договор = Договор;
			Движение.Клиент = Клиент;
			Движение.Сумма = Сумма;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
