
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПересчитатьКоличествоДней();
	
	Если Объект.Квартира = Неопределено Тогда
		Объект.Цена = 0
	КонецЕсли;
	
	Объект.Цена = ЦеныНаКвартирыПосуточноВызовСервера.ПолучитьЦенуНаКвартиру(Объект.Квартира);
	
	ПересчитатьСумму();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ПроверитьЗанятостьКвартиры() Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Квартира занята в эти даты!";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ПересчитатьКоличествоДней();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ПересчитатьКоличествоДней();
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	Если Объект.Квартира = Неопределено Тогда
		Объект.Цена = 0
	КонецЕсли;
	
	Объект.Цена = ЦеныНаКвартирыПосуточноВызовСервера.ПолучитьЦенуНаКвартиру(Объект.Квартира);
	
	ПересчитатьСумму();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПроверитьЗанятостьКвартиры() 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтрольСдачиКвартир.ДатаНачала КАК ДатаНачала,
		|	КонтрольСдачиКвартир.ДатаОкончания КАК ДатаОкончания,
		|	КонтрольСдачиКвартир.Квартира КАК Квартира,
		|	КонтрольСдачиКвартир.Сдача КАК Сдача
		|ИЗ
		|	РегистрСведений.КонтрольСдачиКвартир КАК КонтрольСдачиКвартир
		|ГДЕ
		|	КонтрольСдачиКвартир.Квартира = &Квартира
		|	И КонтрольСдачиКвартир.ДатаНачала < &ДатаОкончания
		|	И КонтрольСдачиКвартир.ДатаОкончания > &ДатаНачала";

// ToDo: Разобраться		
//	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
//		Запрос.Текст = Запрос.Текст + 
//        "|    И КонтрольСдачиКвартир.Сдача <> &ТекущаяСсылка";
//        Запрос.УстановитьПараметр("ТекущаяСсылка", Объект.Ссылка);
//	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("Квартира", Объект.Квартира);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьКоличествоДней()
	
	ДатаНачала = Объект.ДатаНачала;
	ДатаОкончания = Объект.ДатаОкончания;
	
	Объект.КоличествоДней = РассчетКоличестваВремени.РассчитатьКоличествоДней(ДатаНачала, ДатаОкончания);
	
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму()
	
	Сумма = Объект.КоличествоДней * Объект.Цена;
	Объект.Сумма = Сумма;
	
КонецПроцедуры



#КонецОбласти
