
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПодготовитьАрхив() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Должность) КАК Должность,
		|	Сотрудники.Фото КАК Фото,
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Ссылка) КАК Сотрудник,
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.ИндентификаторПользователяИБ) КАК Индентификатор
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИмяКаталога = ПолучитьИмяВременногоФайла("");
	СоздатьКаталог(ИмяКаталога);
	
	ОписаниеСотрудников = Новый Массив;
	
	ШаблонИмениКартинки = "%1%2img%2%3.jpg";
	
	Пока Выборка.Следующий() Цикл
		
		ОписаниеСотрудника = Новый Структура;
		ОписаниеСотрудника.Вставить("Индентификатор", Выборка.Индентификатор);
		ОписаниеСотрудника.Вставить("Сотрудник", Выборка.Сотрудник);
		ОписаниеСотрудника.Вставить("Должность", Выборка.Должность);
		
		Фото = Выборка.Фото.Получить();
		
		Если ТипЗнч(Фото) = Тип("Картинка") Тогда
			ДанныеФото = Фото.ПолучитьДвоичныеДанные();
		Иначе
			ДанныеФото = Фото;
		КонецЕсли;
		
		
		
		Если ДанныеФото = Неопределено Тогда
			ОписаниеСотрудника.Вставить("Фото", Неопределено);
		Иначе
			ИмяФайла = СтрШаблон(ШаблонИмениКартинки, ИмяКаталога, ПолучитьРазделительПути(), Выборка.Индентификатор);
			ДанныеФото.Записать(ИмяФайла);
			ОписаниеСотрудника.Вставить("Фото", СтрШаблон(ШаблонИмениКартинки, "", ПолучитьРазделительПути(), Выборка.Индентификатор));
		КонецЕсли;
		
		ОписаниеСотрудников.Добавить(ОписаниеСотрудника);
		
	КонецЦикла;
	
	ШаблонИмениФайлаВыгрузки = "%1%2export.json";
	ИмяФайлаВыгрузки = СтрШаблон(ШаблонИмениФайлаВыгрузки, ИмяКаталога, ПолучитьРазделительПути());
	
	Запись = Новый ЗаписьJSON();
	Запись.ОткрытьФайл(ИмяФайлаВыгрузки);
	ЗаписатьJSON(Запись, ОписаниеСотрудников);
	Запись.Закрыть();
	
	Архиватор = Новый ЗаписьФайлаАрхива;
	Архиватор.Добавить(ИмяКаталога + ПолучитьРазделительПути() + "*.*",,РежимОбработкиПодкаталоговФайлаАрхива.ОбрабатыватьРекурсивно);
	ДанныеАрхива = Архиватор.ПолучитьДвоичныеДанные();
	
	
	
	УдалитьФайлы(ИмяКаталога);
	
	Возврат ДанныеАрхива;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
