#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПересчитатьКоличествоДней();
	
	Если Объект.Квартира = Неопределено Тогда
		Объект.Цена = 0
	КонецЕсли;
	
	Объект.Цена = ЦеныНаКвартирыПосуточноВызовСервера.ПолучитьЦенуНаКвартиру(Объект.Квартира);
	
	ПересчитатьСумму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ПересчитатьКоличествоДней();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ПересчитатьКоличествоДней();
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	Если Объект.Квартира = Неопределено Тогда
		Объект.Цена = 0
	КонецЕсли;
	
	Объект.Цена = ЦеныНаКвартирыПосуточноВызовСервера.ПолучитьЦенуНаКвартиру(Объект.Квартира);
	
	ПересчитатьСумму();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчитатьКоличествоДней()
	
	ДатаНачала = Объект.ДатаНачала;
	ДатаОкончания = Объект.ДатаОкончания;
	
	Объект.КоличествоДней = РассчетКоличестваВремени.РассчитатьКоличествоДней(ДатаНачала, ДатаОкончания);
	
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму()
	
	Сумма = Объект.КоличествоДней * Объект.Цена;
	Объект.Сумма = Сумма;
	
КонецПроцедуры

#КонецОбласти
