
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПересчитатьКоличествоМесяцев();
	
	ПересчитатьСумму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ПересчитатьКоличествоМесяцев();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ПересчитатьКоличествоМесяцев();
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	Если Объект.Квартира = Неопределено Тогда
		Объект.Цена = 0
	КонецЕсли;
	
	ПересчитатьСумму();
КонецПроцедуры


&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры


&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ПодставитьЦенуИзДоговора();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчитатьКоличествоМесяцев()
	
	ДатаНачала = Объект.ДатаНачала;
	ДатаОкончания = Объект.ДатаОкончания;
	
	Объект.КоличествоМесяцев = РассчетКоличестваВремени.РассчитатьКоличествоМесяцев(ДатаНачала, ДатаОкончания);
	
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму()
	
	Сумма = Объект.КоличествоМесяцев * Объект.Цена;
	Объект.Сумма = Сумма;
	
КонецПроцедуры

&НаСервере
Процедура ПодставитьЦенуИзДоговора()
	
	Объект.Цена = Объект.Договор.Цена;
	
КонецПроцедуры



#КонецОбласти
