#Область СлужебныеПроцедурыИФункции
Функция РассчитатьКоличествоДней(ДатаНачала, ДатаОкончания) Экспорт
	
	Если ДатаНачала = Неопределено ИЛИ ДатаОкончания = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ДатаОкончания < ДатаНачала Тогда
		Возврат 0;
	КонецЕсли;
	
	КоличествоДней = (ДатаОкончания - ДатаНачала) / (24 * 60 * 60);
	
	Возврат Цел(КоличествоДней);
КонецФункции

Функция РассчитатьКоличествоМесяцев(ДатаНачала, ДатаОкончания) Экспорт
	
	Если ДатаНачала = Неопределено ИЛИ ДатаОкончания = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ДатаОкончания < ДатаНачала Тогда
		Возврат 0;
	КонецЕсли;
	
	КоличествоМесяцев = (ДатаОкончания - ДатаНачала) / (24 * 60 * 60 * 30);
	
	Возврат Цел(КоличествоМесяцев);
КонецФункции
#КонецОбласти
