#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЦенуНаКвартиру(Квартира) Экспорт
	
	Если Квартира = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныНаКвартирыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНаКвартиры.СрезПоследних КАК ЦеныНаКвартирыСрезПоследних
		|ГДЕ
		|	ЦеныНаКвартирыСрезПоследних.Квартира = &Квартира";
	
	Запрос.УстановитьПараметр("Квартира", Квартира);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Цена;
	Иначе
		Возврат 0;
	КонецЕсли
	
	
	
КонецФункции

#КонецОбласти
