
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьАрхивВФоне(АдресРезультата) Экспорт
	
	Результат = ВыгрузитьСервер();
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Функция ВыгрузитьСервер()
	ОбработкаОбъект = Обработки.ВыгрузитьСотрудниковВАрхив.Создать();
	АдресАрхива = ОбработкаОбъект.ПодготовитьАрхив();
	
	ОкончаниеОжидания = ТекущаяДатаСеанса() + 5;
	
	Пока ТекущаяДатаСеанса() < ОкончаниеОжидания Цикл
		Цикличность = 1;
	КонецЦикла;
	
	Возврат АдресАрхива;
КонецФункции

#КонецОбласти
