
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	Объект.ТелефонКлиента = ПолучитьТелефонКлиента(Объект.Квартира);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТелефонКлиента(Квартира)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтрольСдачиКвартир.Договор.Владелец.Телефон КАК Телефон
		|ИЗ
		|	РегистрСведений.КонтрольСдачиКвартир КАК КонтрольСдачиКвартир
		|ГДЕ
		|	КонтрольСдачиКвартир.Квартира = &Квартира
		|	И КонтрольСдачиКвартир.Договор.ВидДоговора = &ВидДоговора
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтрольСдачиКвартир.ДатаОкончания УБЫВ";
	Запрос.УстановитьПараметр("Квартира", Квартира);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидДоговора.САрендатором);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Телефон;
	КонецЕсли;
	
	Возврат "";
КонецФункции

#КонецОбласти
