#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверкаВидаДоговора();
	
	УстановкаЦеныНаКвартиру()
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	
	УстановкаЦеныНаКвартиру();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ПроверкаВидаДоговора();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверкаВидаДоговора()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидДоговора.САрендатором") Тогда
		Элементы.Цена.Заголовок = "Цена за сутки";
	Иначе
		Элементы.Цена.Заголовок = "Цена";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаЦеныНаКвартиру()

	Если Объект.Квартира = Неопределено Тогда
		Объект.Цена = 0
	КонецЕсли;
	
	Объект.Цена = ЦеныНаКвартирыВызовСервера.ПолучитьЦенуНаКвартиру(Объект.Квартира);

КонецПроцедуры

#КонецОбласти
