#Область ОбработчикиСобытий
Функция pingПроверитьДоступноость(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("OK");
	Возврат Ответ;
КонецФункции

Функция ExchangeПолучитьДанные(Запрос)
	
	Попытка
        ИдентификаторКлиента = Запрос.Заголовки.Получить("X-MobileID");
        НомерПринятогоСообщения = Запрос.Заголовки.Получить("X-Received-Message");
        
        // Преобразуем номер сообщения в число
        Если НомерПринятогоСообщения = Неопределено Тогда
            НомерПринятогоСообщения = 0;
        Иначе
            НомерПринятогоСообщения = Число(НомерПринятогоСообщения);
        КонецЕсли;
        
        ТелоОтвета = ОбменМобильноеПриложение.СформироватьДанныеОтвета(ИдентификаторКлиента, НомерПринятогоСообщения);
        
        Ответ = Новый HTTPСервисОтвет(200);
        Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
        Возврат Ответ;
    Исключение
        // Возвращаем ошибку клиенту
        Ответ = Новый HTTPСервисОтвет(500);
        Ответ.УстановитьТелоИзСтроки(ОписаниеОшибки());
        Возврат Ответ;
    КонецПопытки;
КонецФункции

#КонецОбласти
