#Область ОбработчикиСобытий
Функция pingПроверитьДоступноость(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("OK");
	Возврат Ответ;
КонецФункции

Функция ExchangeПолучитьДанные(Запрос)
	
	ИдентификаторКлиента = Запрос.ПараметрыЗапроса.Получить("X-MobileID");
	НомерПринятогоСообщения = Число(Запрос.ПараметрыЗапроса.Получить("X-ReceivedMessage"));
	
	ТелоОтвета = ОбменМобильноеПриложение.СформироватьДанныеОтвета(ИдентификаторКлиента, НомерПринятогоСообщения);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Возврат Ответ;
КонецФункции
#КонецОбласти
